Revit 2027 API
PipeFittingAndAccessoryPressureDropData Properties
The PipeFittingAndAccessoryPressureDropData type exposes the following members.
Properties
Name | Description
CalculationType |  The calculation type, a bitmask of FittingAndAccessoryCalculationType.
IsCurrentEntityValid |  True if the current settings stored in the entity is valid.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
See Also
Reference
PipeFittingAndAccessoryPressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace